*> ================================================================
*> CobTk
*> Public definitions for GnuCOBOL applications
*> ================================================================

78 CTK-OK                 VALUE 0.
78 CTK-ERROR              VALUE 1.
78 CTK-BUFFER-TOO-SMALL   VALUE 2.

78 CTK-FALSE              VALUE 0.
78 CTK-TRUE               VALUE 1.

01 CTK-STATUS             PIC S9(9) COMP-5 VALUE 0.
01 CTK-RUNNING            PIC S9(9) COMP-5 VALUE 1.
01 CTK-EVENT              PIC S9(9) COMP-5 VALUE 0.
